#  CRUD on Pandas

In [48]:
import pandas as pd

### 1. Create

#### 1.1 create from a CSV

In [49]:
df = pd.read_csv("World University Rankings 2023.csv")

#### 1.2 create from a Dictionary

In [50]:
tempdict = {"column1" : [1,2,3], "column2" : [4,5,6], "column3" : [7,8,9],}

In [51]:
dictdf = pd.DataFrame.from_dict(tempdict)

### 2. Read

#### 2.1 Show top 5 and bottom Rows

In [52]:
df.head(10)

,University Rank,Name of University,Location,No of student,No of student per staff,International Student,Female:Male Ratio,OverAll Score,Teaching Score,Research Score,Citations Score,Industry Income Score,International Outlook Score
0,1,University of Oxford,United Kingdom,"20,965",10.6,42%,48 : 52,96.4,92.3,99.7,99.0,74.9,96.2
1,2,Harvard University,United States,"21,887",9.6,25%,50 : 50,95.2,94.8,99.0,99.3,49.5,80.5
2,3,University of Cambridge,United Kingdom,"20,185",11.3,39%,47 : 53,94.8,90.9,99.5,97.0,54.2,95.8
3,3,Stanford University,United States,"16,164",7.1,24%,46 : 54,94.8,94.2,96.7,99.8,65.0,79.8
4,5,Massachusetts Institute of Technology,United States,"11,415",8.2,33%,40 : 60,94.2,90.7,93.6,99.8,90.9,89.3
5,6,California Institute of Technology,United States,"2,237",6.2,34%,37 : 63,94.1,90.9,97.0,97.3,89.8,83.6
6,7,Princeton University,United States,"8,279",8.0,23%,46 : 54,92.4,87.6,95.9,99.1,66.0,80.3
7,8,"University of California, Berkeley",United States,"40,921",18.4,24%,52 : 48,92.1,86.4,95.8,99.0,76.8,78.4
8,9,Yale University,United States,"13,482",5.9,21%,52 : 48,91.4,92.6,92.7,97.0,55.0,70.9
9,10,Imperial College London,United Kingdom,"18,545",11.2,61%,40 : 60,90.4,82.8,90.8,98.3,59.8,97.5

In [53]:
df.tail(5)

,University Rank,Name of University,Location,No of student,No of student per staff,International Student,Female:Male Ratio,OverAll Score,Teaching Score,Research Score,Citations Score,Industry Income Score,International Outlook Score
2336,-,University of the West of Scotland,NaN,NaN,NaN,NaN,NaN,34.0–39.2,24.1,15.5,61.5,37.9,76.8
2337,-,University of Windsor,NaN,NaN,NaN,NaN,NaN,34.0–39.2,35.1,29.4,34.5,44.2,88.7
2338,-,University of Wolverhampton,NaN,NaN,NaN,NaN,NaN,34.0–39.2,18.2,14.3,68.8,37.3,72.0
2339,-,University of Wuppertal,NaN,NaN,NaN,NaN,NaN,34.0–39.2,26.4,26.7,52.8,52.1,47.6
2340,-,Xi’an Jiaotong-Liverpool University,NaN,NaN,NaN,NaN,NaN,34.0–39.2,17.8,14.8,68.2,38.2,72.4

In [54]:
dictdf.head()

   column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9

#### 2.2 Show Columns and Data Type

In [55]:
df.columns

Index(['University Rank', 'Name of University', 'Location', 'No of student',
       'No of student per staff', 'International Student', 'Female:Male Ratio',
       'OverAll Score', 'Teaching Score', 'Research Score', 'Citations Score',
       'Industry Income Score', 'International Outlook Score'],
      dtype='object')

In [56]:
df.dtypes

University Rank                 object
Name of University              object
Location                        object
No of student                   object
No of student per staff        float64
International Student           object
Female:Male Ratio               object
OverAll Score                   object
Teaching Score                 float64
Research Score                 float64
Citations Score                float64
Industry Income Score          float64
International Outlook Score    float64
dtype: object

#### 2.3 Summary Statistics

In [57]:
df.describe()

,No of student per staff,Teaching Score,Research Score,Citations Score,Industry Income Score,International Outlook Score
count,2208.000000,1799.000000,1799.000000,1799.000000,1799.000000,1799.000000
mean,19.000408,27.018010,23.016898,48.495887,47.104558,46.880378
std,12.132224,13.282243,16.763819,27.967185,15.093682,22.582401
min,0.400000,11.600000,7.400000,0.800000,36.900000,14.100000
25%,12.600000,18.000000,11.300000,23.100000,37.800000,27.900000
50%,16.600000,22.700000,17.000000,47.200000,40.500000,42.100000
75%,22.200000,31.850000,28.900000,72.350000,48.300000,62.100000
max,232.200000,94.800000,99.700000,100.000000,100.000000,99.700000

In [58]:
df.describe(include='object')

,University Rank,Name of University,Location,No of student,International Student,Female:Male Ratio,OverAll Score
count,2341,2233,2047,2209,2209,2128,1799
unique,162,2233,116,2136,79,87,160
top,Reporter,University of Oxford,United States,"17,080",0%,58 : 42,18.4–24.3
freq,512,1,173,2,336,95,305

#### 2.4 Filterig Columns

In [59]:
df["University Rank"]

0       1
1       2
2       3
3       3
4       5
       ..
2336    -
2337    -
2338    -
2339    -
2340    -
Name: University Rank, Length: 2341, dtype: object

In [60]:
df["No of student"]

0       20,965
1       21,887
2       20,185
3       16,164
4       11,415
         ...
2336       NaN
2337       NaN
2338       NaN
2339       NaN
2340       NaN
Name: No of student, Length: 2341, dtype: object

- Sotring the universities by the rank and number of students

In [61]:
df[["Name of University","University Rank", "No of student" ]]

                         Name of University University Rank No of student
0                      University of Oxford               1        20,965
1                        Harvard University               2        21,887
2                   University of Cambridge               3        20,185
3                       Stanford University               3        16,164
4     Massachusetts Institute of Technology               5        11,415
...                                     ...             ...           ...
2336     University of the West of Scotland               -           NaN
2337                  University of Windsor               -           NaN
2338            University of Wolverhampton               -           NaN
2339                University of Wuppertal               -           NaN
2340    Xi’an Jiaotong-Liverpool University               -           NaN

[2341 rows x 3 columns]

In [62]:
df["Name of University"].unique()

array(['University of Oxford', 'Harvard University',
       'University of Cambridge', ..., 'University of Wolverhampton',
       'University of Wuppertal', 'Xi’an Jiaotong-Liverpool University'],
      dtype=object)

In [63]:
df["University Rank"].unique()

array(['1', '2', '3', '5', '6', '7', '8', '9', '10', '11', '13', '14',
       '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25',
       '26', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37',
       '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48',
       '49', '50', '51', '52', '53', '54', '56', '57', '58', '59', '60',
       '61', '62', '63', '64', '65', '66', '67', '68', '69', '70', '71',
       '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '85',
       '86', '88', '89', '90', '91', '93', '94', '95', '98', '99', '101',
       '104', '106', '107', '108', '110', '111', '112', '113', '114',
       '117', '118', '119', '121', '122', '123', '124', '126', '127',
       '128', '130', '131', '133', '134', '135', '136', '137', '139',
       '144', '145', '146', '147', '148', '151', '154', '155', '156',
       '160', '161', '163', '166', '168', '170', '173', '174', '175',
       '176', '179', '180', '181', '182', '183', '185', '186', '187',
       '189', '191', '192', '194', '196', '198', '201–250', '251–300',
       '301–350', '351–400', '401–500', '501–600', '601–800', '801–1000',
       '1001–1200', '1201–1500', '1501+', 'Reporter', '-'], dtype=object)

In [64]:
df.head()

,University Rank,Name of University,Location,No of student,No of student per staff,International Student,Female:Male Ratio,OverAll Score,Teaching Score,Research Score,Citations Score,Industry Income Score,International Outlook Score
0,1,University of Oxford,United Kingdom,"20,965",10.6,42%,48 : 52,96.4,92.3,99.7,99.0,74.9,96.2
1,2,Harvard University,United States,"21,887",9.6,25%,50 : 50,95.2,94.8,99.0,99.3,49.5,80.5
2,3,University of Cambridge,United Kingdom,"20,185",11.3,39%,47 : 53,94.8,90.9,99.5,97.0,54.2,95.8
3,3,Stanford University,United States,"16,164",7.1,24%,46 : 54,94.8,94.2,96.7,99.8,65.0,79.8
4,5,Massachusetts Institute of Technology,United States,"11,415",8.2,33%,40 : 60,94.2,90.7,93.6,99.8,90.9,89.3

- Selecting with a criteria

In [77]:
selected_columns_df = df.loc[:, ["University Rank", "Name of University"]]
print(selected_columns_df)

     University Rank                     Name of University
0                  1                   University of Oxford
1                  2                     Harvard University
2                  3                University of Cambridge
3                  3                    Stanford University
4                  5  Massachusetts Institute of Technology
...              ...                                    ...
2336               -     University of the West of Scotland
2337               -                  University of Windsor
2338               -            University of Wolverhampton
2339               -                University of Wuppertal
2340               -    Xi’an Jiaotong-Liverpool University

[2341 rows x 2 columns]

In [78]:
df[["University Rank", "Name of University"]]

     University Rank                     Name of University
0                  1                   University of Oxford
1                  2                     Harvard University
2                  3                University of Cambridge
3                  3                    Stanford University
4                  5  Massachusetts Institute of Technology
...              ...                                    ...
2336               -     University of the West of Scotland
2337               -                  University of Windsor
2338               -            University of Wolverhampton
2339               -                University of Wuppertal
2340               -    Xi’an Jiaotong-Liverpool University

[2341 rows x 2 columns]

In [82]:
selected_university = df[df["University Rank"] == "6"]
print(selected_university)

  University Rank                  Name of University       Location  \
5               6  California Institute of Technology  United States

  No of student  No of student per staff International Student  \
5         2,237                      6.2                   34%

  Female:Male Ratio OverAll Score  Teaching Score  Research Score  \
5           37 : 63          94.1            90.9            97.0

   Citations Score  Industry Income Score  International Outlook Score
5             97.3                   89.8                         83.6

In [86]:
df[(df["Name of University"]) & (df["University Rank"] == "100")]

TypeError: unsupported operand type(s) for &: 'str' and 'bool'

In [87]:
df[(df["University Rank"] < 100) & (df["Name of University"].notnull())]

TypeError: '<' not supported between instances of 'str' and 'int'

Fixing the data type eror

In [89]:
# Convert "University Rank" column to numeric
df["University Rank"] = pd.to_numeric(df["University Rank"], errors="coerce")

# Filter the DataFrame based on the converted "University Rank" column
filtered_df = df[(df["University Rank"] < 100) & (df["Name of University"].notnull())]
print(filtered_df)

    University Rank                     Name of University        Location  \
0               1.0                   University of Oxford  United Kingdom
1               2.0                     Harvard University   United States
2               3.0                University of Cambridge  United Kingdom
3               3.0                    Stanford University   United States
4               5.0  Massachusetts Institute of Technology   United States
..              ...                                    ...             ...
95             95.0        Institut Polytechnique de Paris          France
96             95.0                     Nanjing University           China
97             98.0                  Vanderbilt University   United States
98             99.0           City University of Hong Kong             NaN
99             99.0                 RWTH Aachen University         Germany

   No of student  No of student per staff International Student  \
0         20,965                     10.6                   42%
1         21,887                      9.6                   25%
2         20,185                     11.3                   39%
3         16,164                      7.1                   24%
4         11,415                      8.2                   33%
..           ...                      ...                   ...
95         5,999                      6.7                   41%
96        36,426                     16.5                    8%
97        12,696                      3.8                   15%
98         9,099                     12.1                   62%
99        39,738                     50.0                   28%

   Female:Male Ratio OverAll Score  Teaching Score  Research Score  \
0            48 : 52          96.4            92.3            99.7
1            50 : 50          95.2            94.8            99.0
2            47 : 53          94.8            90.9            99.5
3            46 : 54          94.8            94.2            96.7
4            40 : 60          94.2            90.7            93.6
..               ...           ...             ...             ...
95           24 : 76          63.6            58.5            58.8
96           54 : 46          63.6            58.4            58.2
97           55 : 45          63.5            49.5            47.5
98           54 : 46          63.4            47.2            53.0
99           33 : 67          63.4            56.8            64.5

    Citations Score  Industry Income Score  International Outlook Score
0              99.0                   74.9                         96.2
1              99.3                   49.5                         80.5
2              97.0                   54.2                         95.8
3              99.8                   65.0                         79.8
4              99.8                   90.9                         89.3
..              ...                    ...                          ...
95             64.8                   72.7                         95.6
96             74.3                   87.3                         55.2
97             96.5                   66.7                         50.6
98             79.9                   76.6                         99.6
99             66.1                   93.8                         65.1

[100 rows x 13 columns]